ggkogkou/motor-controller-samd/src/packs/ATSAMD21J18A_DFP/component/fuses.h
/*
 * Component description for FUSES
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-11-25T06:52:33Z */
#ifndef _SAMD21_FUSES_COMPONENT_H_
#define _SAMD21_FUSES_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR FUSES                                        */
/* ************************************************************************** */

/* -------- FUSES_TEMP_LOG_WORD_0 : (FUSES Offset: 0x00) ( R/ 32) TEMP_LOG Page Word 0 -------- */
#define FUSES_TEMP_LOG_WORD_0_ROOM_TEMP_VAL_INT_Pos                                                                    \
        _UINT32_(0) /* (FUSES_TEMP_LOG_WORD_0) Integer part of room temperature in oC Position */
#define FUSES_TEMP_LOG_WORD_0_ROOM_TEMP_VAL_INT_Msk                                                                    \
        (_UINT32_(0xFF) << FUSES_TEMP_LOG_WORD_0_ROOM_TEMP_VAL_INT_Pos) /* (FUSES_TEMP_LOG_WORD_0) Integer part of     \
                                                                           room temperature in oC Mask */
#define FUSES_TEMP_LOG_WORD_0_ROOM_TEMP_VAL_INT(value)                                                                 \
        (FUSES_TEMP_LOG_WORD_0_ROOM_TEMP_VAL_INT_Msk &                                                                 \
         (_UINT32_(value) << FUSES_TEMP_LOG_WORD_0_ROOM_TEMP_VAL_INT_Pos)) /* Assigment of value for ROOM_TEMP_VAL_INT \
                                                                              in the FUSES_TEMP_LOG_WORD_0 register */
#define FUSES_TEMP_LOG_WORD_0_ROOM_TEMP_VAL_DEC_Pos                                                                    \
        _UINT32_(8) /* (FUSES_TEMP_LOG_WORD_0) Decimal part of room temperature Position */
#define FUSES_TEMP_LOG_WORD_0_ROOM_TEMP_VAL_DEC_Msk                                                                    \
        (_UINT32_(0xF) << FUSES_TEMP_LOG_WORD_0_ROOM_TEMP_VAL_DEC_Pos) /* (FUSES_TEMP_LOG_WORD_0) Decimal part of room \
                                                                          temperature Mask */
#define FUSES_TEMP_LOG_WORD_0_ROOM_TEMP_VAL_DEC(value)                                                                 \
        (FUSES_TEMP_LOG_WORD_0_ROOM_TEMP_VAL_DEC_Msk &                                                                 \
         (_UINT32_(value) << FUSES_TEMP_LOG_WORD_0_ROOM_TEMP_VAL_DEC_Pos)) /* Assigment of value for ROOM_TEMP_VAL_DEC \
                                                                              in the FUSES_TEMP_LOG_WORD_0 register */
#define FUSES_TEMP_LOG_WORD_0_HOT_TEMP_VAL_INT_Pos                                                                     \
        _UINT32_(12) /* (FUSES_TEMP_LOG_WORD_0) Integer part of hot temperature in oC Position */
#define FUSES_TEMP_LOG_WORD_0_HOT_TEMP_VAL_INT_Msk                                                                     \
        (_UINT32_(0xFF) << FUSES_TEMP_LOG_WORD_0_HOT_TEMP_VAL_INT_Pos) /* (FUSES_TEMP_LOG_WORD_0) Integer part of hot  \
                                                                          temperature in oC Mask */
#define FUSES_TEMP_LOG_WORD_0_HOT_TEMP_VAL_INT(value)                                                                  \
        (FUSES_TEMP_LOG_WORD_0_HOT_TEMP_VAL_INT_Msk &                                                                  \
         (_UINT32_(value) << FUSES_TEMP_LOG_WORD_0_HOT_TEMP_VAL_INT_Pos)) /* Assigment of value for HOT_TEMP_VAL_INT   \
                                                                             in the FUSES_TEMP_LOG_WORD_0 register */
#define FUSES_TEMP_LOG_WORD_0_HOT_TEMP_VAL_DEC_Pos                                                                     \
        _UINT32_(20) /* (FUSES_TEMP_LOG_WORD_0) Decimal part of hot temperature Position */
#define FUSES_TEMP_LOG_WORD_0_HOT_TEMP_VAL_DEC_Msk                                                                     \
        (_UINT32_(0xF) << FUSES_TEMP_LOG_WORD_0_HOT_TEMP_VAL_DEC_Pos) /* (FUSES_TEMP_LOG_WORD_0) Decimal part of hot   \
                                                                         temperature Mask */
#define FUSES_TEMP_LOG_WORD_0_HOT_TEMP_VAL_DEC(value)                                                                  \
        (FUSES_TEMP_LOG_WORD_0_HOT_TEMP_VAL_DEC_Msk &                                                                  \
         (_UINT32_(value) << FUSES_TEMP_LOG_WORD_0_HOT_TEMP_VAL_DEC_Pos)) /* Assigment of value for HOT_TEMP_VAL_DEC   \
                                                                             in the FUSES_TEMP_LOG_WORD_0 register */
#define FUSES_TEMP_LOG_WORD_0_ROOM_INT1V_VAL_Pos                                                                       \
        _UINT32_(24) /* (FUSES_TEMP_LOG_WORD_0) 2's complement of the internal 1V reference drift at room temperature  \
                        (versus a 1.0 centered value) Position */
#define FUSES_TEMP_LOG_WORD_0_ROOM_INT1V_VAL_Msk                                                                       \
        (_UINT32_(0xFF)                                                                                                \
         << FUSES_TEMP_LOG_WORD_0_ROOM_INT1V_VAL_Pos) /* (FUSES_TEMP_LOG_WORD_0) 2's complement of the internal 1V     \
                                                         reference drift at room temperature (versus a 1.0 centered    \
                                                         value) Mask */
#define FUSES_TEMP_LOG_WORD_0_ROOM_INT1V_VAL(value)                                                                    \
        (FUSES_TEMP_LOG_WORD_0_ROOM_INT1V_VAL_Msk &                                                                    \
         (_UINT32_(value) << FUSES_TEMP_LOG_WORD_0_ROOM_INT1V_VAL_Pos)) /* Assigment of value for ROOM_INT1V_VAL in    \
                                                                           the FUSES_TEMP_LOG_WORD_0 register */
#define FUSES_TEMP_LOG_WORD_0_Msk _UINT32_(0xFFFFFFFF) /* (FUSES_TEMP_LOG_WORD_0) Register Mask  */


/* -------- FUSES_TEMP_LOG_WORD_1 : (FUSES Offset: 0x04) ( R/ 32) TEMP_LOG Page Word 1 -------- */
#define FUSES_TEMP_LOG_WORD_1_HOT_INT1V_VAL_Pos                                                                        \
        _UINT32_(0) /* (FUSES_TEMP_LOG_WORD_1) 2's complement of the internal 1V reference drift at hot temperature    \
                       (versus a 1.0 centered value) Position */
#define FUSES_TEMP_LOG_WORD_1_HOT_INT1V_VAL_Msk                                                                        \
        (_UINT32_(0xFF) << FUSES_TEMP_LOG_WORD_1_HOT_INT1V_VAL_Pos) /* (FUSES_TEMP_LOG_WORD_1) 2's complement of the   \
                                                                       internal 1V reference drift at hot temperature  \
                                                                       (versus a 1.0 centered value) Mask */
#define FUSES_TEMP_LOG_WORD_1_HOT_INT1V_VAL(value)                                                                     \
        (FUSES_TEMP_LOG_WORD_1_HOT_INT1V_VAL_Msk &                                                                     \
         (_UINT32_(value) << FUSES_TEMP_LOG_WORD_1_HOT_INT1V_VAL_Pos)) /* Assigment of value for HOT_INT1V_VAL in the  \
                                                                          FUSES_TEMP_LOG_WORD_1 register */
#define FUSES_TEMP_LOG_WORD_1_ROOM_ADC_VAL_Pos                                                                         \
        _UINT32_(8) /* (FUSES_TEMP_LOG_WORD_1) 12-bit ADC conversion at room temperature Position */
#define FUSES_TEMP_LOG_WORD_1_ROOM_ADC_VAL_Msk                                                                         \
        (_UINT32_(0xFFF) << FUSES_TEMP_LOG_WORD_1_ROOM_ADC_VAL_Pos) /* (FUSES_TEMP_LOG_WORD_1) 12-bit ADC conversion   \
                                                                       at room temperature Mask */
#define FUSES_TEMP_LOG_WORD_1_ROOM_ADC_VAL(value)                                                                      \
        (FUSES_TEMP_LOG_WORD_1_ROOM_ADC_VAL_Msk &                                                                      \
         (_UINT32_(value) << FUSES_TEMP_LOG_WORD_1_ROOM_ADC_VAL_Pos)) /* Assigment of value for ROOM_ADC_VAL in the    \
                                                                         FUSES_TEMP_LOG_WORD_1 register */
#define FUSES_TEMP_LOG_WORD_1_HOT_ADC_VAL_Pos                                                                          \
        _UINT32_(20) /* (FUSES_TEMP_LOG_WORD_1) 12-bit ADC conversion at hot temperature Position */
#define FUSES_TEMP_LOG_WORD_1_HOT_ADC_VAL_Msk                                                                          \
        (_UINT32_(0xFFF) << FUSES_TEMP_LOG_WORD_1_HOT_ADC_VAL_Pos) /* (FUSES_TEMP_LOG_WORD_1) 12-bit ADC conversion at \
                                                                      hot temperature Mask */
#define FUSES_TEMP_LOG_WORD_1_HOT_ADC_VAL(value)                                                                       \
        (FUSES_TEMP_LOG_WORD_1_HOT_ADC_VAL_Msk &                                                                       \
         (_UINT32_(value) << FUSES_TEMP_LOG_WORD_1_HOT_ADC_VAL_Pos)) /* Assigment of value for HOT_ADC_VAL in the      \
                                                                        FUSES_TEMP_LOG_WORD_1 register */
#define FUSES_TEMP_LOG_WORD_1_Msk _UINT32_(0xFFFFFFFF) /* (FUSES_TEMP_LOG_WORD_1) Register Mask  */


/* -------- FUSES_OTP4_WORD_0 : (FUSES Offset: 0x00) ( R/ 32) OTP4 Page Word 0 -------- */
#define FUSES_OTP4_WORD_0_ADC_LINEARITY_0_Pos _UINT32_(27) /* (FUSES_OTP4_WORD_0) ADC Linearity bits 4:0 Position */
#define FUSES_OTP4_WORD_0_ADC_LINEARITY_0_Msk                                                                          \
        (_UINT32_(0x1F) << FUSES_OTP4_WORD_0_ADC_LINEARITY_0_Pos) /* (FUSES_OTP4_WORD_0) ADC Linearity bits 4:0 Mask   \
                                                                   */
#define FUSES_OTP4_WORD_0_ADC_LINEARITY_0(value)                                                                       \
        (FUSES_OTP4_WORD_0_ADC_LINEARITY_0_Msk &                                                                       \
         (_UINT32_(value) << FUSES_OTP4_WORD_0_ADC_LINEARITY_0_Pos)) /* Assigment of value for ADC_LINEARITY_0 in the  \
                                                                        FUSES_OTP4_WORD_0 register */
#define FUSES_OTP4_WORD_0_Msk _UINT32_(0xF8000000) /* (FUSES_OTP4_WORD_0) Register Mask  */


