ggkogkou/motor-controller-samd/src/packs/ATSAMD21J18A_DFP/component/fuses.h
/* -------- FUSES_USER_WORD_0 : (FUSES Offset: 0x00) (R/W 32) USER Page Word 0 -------- */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos _UINT32_(0) /* (FUSES_USER_WORD_0) Bootloader Size Position */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Msk                                                                         \
        (_UINT32_(0x7) << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos) /* (FUSES_USER_WORD_0) Bootloader Size Mask */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT(value)                                                                      \
        (FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Msk &                                                                      \
         (_UINT32_(value) << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos)) /* Assigment of value for NVMCTRL_BOOTPROT in    \
                                                                         the FUSES_USER_WORD_0 register */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_SIZE_0BYTES_Val _UINT32_(0x7) /* (FUSES_USER_WORD_0) 0 Bytes  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_SIZE_512BYTES_Val _UINT32_(0x6) /* (FUSES_USER_WORD_0) 512 Bytes  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_SIZE_1024BYTES_Val _UINT32_(0x5) /* (FUSES_USER_WORD_0) 1024 Bytes  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_SIZE_2048BYTES_Val _UINT32_(0x4) /* (FUSES_USER_WORD_0) 2048 Bytes  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_SIZE_4096BYTES_Val _UINT32_(0x3) /* (FUSES_USER_WORD_0) 4096 Bytes  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_SIZE_8192BYTES_Val _UINT32_(0x2) /* (FUSES_USER_WORD_0) 8192 Bytes  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_SIZE_16384BYTES_Val _UINT32_(0x1) /* (FUSES_USER_WORD_0) 16384 Bytes  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_SIZE_32768BYTES_Val _UINT32_(0x0) /* (FUSES_USER_WORD_0) 32768 Bytes  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_SIZE_0BYTES                                                                 \
        (FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_SIZE_0BYTES_Val                                                            \
         << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos) /* (FUSES_USER_WORD_0) 0 Bytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_SIZE_512BYTES                                                               \
        (FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_SIZE_512BYTES_Val                                                          \
         << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos) /* (FUSES_USER_WORD_0) 512 Bytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_SIZE_1024BYTES                                                              \
        (FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_SIZE_1024BYTES_Val                                                         \
         << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos) /* (FUSES_USER_WORD_0) 1024 Bytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_SIZE_2048BYTES                                                              \
        (FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_SIZE_2048BYTES_Val                                                         \
         << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos) /* (FUSES_USER_WORD_0) 2048 Bytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_SIZE_4096BYTES                                                              \
        (FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_SIZE_4096BYTES_Val                                                         \
         << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos) /* (FUSES_USER_WORD_0) 4096 Bytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_SIZE_8192BYTES                                                              \
        (FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_SIZE_8192BYTES_Val                                                         \
         << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos) /* (FUSES_USER_WORD_0) 8192 Bytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_SIZE_16384BYTES                                                             \
        (FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_SIZE_16384BYTES_Val                                                        \
         << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos) /* (FUSES_USER_WORD_0) 16384 Bytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_SIZE_32768BYTES                                                             \
        (FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_SIZE_32768BYTES_Val                                                        \
         << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos) /* (FUSES_USER_WORD_0) 32768 Bytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_Pos _UINT32_(4) /* (FUSES_USER_WORD_0) EEPROM Size Position */
#define FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_Msk                                                                      \
        (_UINT32_(0x7) << FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_Pos) /* (FUSES_USER_WORD_0) EEPROM Size Mask */
#define FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE(value)                                                                   \
        (FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_Msk &                                                                   \
         (_UINT32_(value) << FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_Pos)) /* Assigment of value for NVMCTRL_EEPROM_SIZE \
                                                                            in the FUSES_USER_WORD_0 register */
#define FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_SIZE_0BYTES_Val _UINT32_(0x7) /* (FUSES_USER_WORD_0) 0 Bytes  */
#define FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_SIZE_256BYTES_Val _UINT32_(0x6) /* (FUSES_USER_WORD_0) 256 Bytes  */
#define FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_SIZE_512BYTES_Val _UINT32_(0x5) /* (FUSES_USER_WORD_0) 512 Bytes  */
#define FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_SIZE_1024BYTES_Val _UINT32_(0x4) /* (FUSES_USER_WORD_0) 1024 Bytes  */
#define FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_SIZE_2048BYTES_Val _UINT32_(0x3) /* (FUSES_USER_WORD_0) 2048 Bytes  */
#define FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_SIZE_4096BYTES_Val _UINT32_(0x2) /* (FUSES_USER_WORD_0) 4096 Bytes  */
#define FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_SIZE_8192BYTES_Val _UINT32_(0x1) /* (FUSES_USER_WORD_0) 8192 Bytes  */
#define FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_SIZE_16384BYTES_Val _UINT32_(0x0) /* (FUSES_USER_WORD_0) 16384 Bytes  */
#define FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_SIZE_0BYTES                                                              \
        (FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_SIZE_0BYTES_Val                                                         \
         << FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_Pos) /* (FUSES_USER_WORD_0) 0 Bytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_SIZE_256BYTES                                                            \
        (FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_SIZE_256BYTES_Val                                                       \
         << FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_Pos) /* (FUSES_USER_WORD_0) 256 Bytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_SIZE_512BYTES                                                            \
        (FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_SIZE_512BYTES_Val                                                       \
         << FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_Pos) /* (FUSES_USER_WORD_0) 512 Bytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_SIZE_1024BYTES                                                           \
        (FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_SIZE_1024BYTES_Val                                                      \
         << FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_Pos) /* (FUSES_USER_WORD_0) 1024 Bytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_SIZE_2048BYTES                                                           \
        (FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_SIZE_2048BYTES_Val                                                      \
         << FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_Pos) /* (FUSES_USER_WORD_0) 2048 Bytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_SIZE_4096BYTES                                                           \
        (FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_SIZE_4096BYTES_Val                                                      \
         << FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_Pos) /* (FUSES_USER_WORD_0) 4096 Bytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_SIZE_8192BYTES                                                           \
        (FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_SIZE_8192BYTES_Val                                                      \
         << FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_Pos) /* (FUSES_USER_WORD_0) 8192 Bytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_SIZE_16384BYTES                                                          \
        (FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_SIZE_16384BYTES_Val                                                     \
         << FUSES_USER_WORD_0_NVMCTRL_EEPROM_SIZE_Pos) /* (FUSES_USER_WORD_0) 16384 Bytes Position  */
#define FUSES_USER_WORD_0_BOD33USERLEVEL_Pos _UINT32_(8) /* (FUSES_USER_WORD_0) BOD33 User Level Position */
#define FUSES_USER_WORD_0_BOD33USERLEVEL_Msk                                                                           \
        (_UINT32_(0x3F) << FUSES_USER_WORD_0_BOD33USERLEVEL_Pos) /* (FUSES_USER_WORD_0) BOD33 User Level Mask */
#define FUSES_USER_WORD_0_BOD33USERLEVEL(value)                                                                        \
        (FUSES_USER_WORD_0_BOD33USERLEVEL_Msk &                                                                        \
         (_UINT32_(value) << FUSES_USER_WORD_0_BOD33USERLEVEL_Pos)) /* Assigment of value for BOD33USERLEVEL in the    \
                                                                       FUSES_USER_WORD_0 register */
#define FUSES_USER_WORD_0_BOD33_EN_Pos _UINT32_(14) /* (FUSES_USER_WORD_0) BOD33 Enable Position */
#define FUSES_USER_WORD_0_BOD33_EN_Msk                                                                                 \
        (_UINT32_(0x1) << FUSES_USER_WORD_0_BOD33_EN_Pos) /* (FUSES_USER_WORD_0) BOD33 Enable Mask */
#define FUSES_USER_WORD_0_BOD33_EN(value)                                                                              \
        (FUSES_USER_WORD_0_BOD33_EN_Msk &                                                                              \
         (_UINT32_(value)                                                                                              \
          << FUSES_USER_WORD_0_BOD33_EN_Pos)) /* Assigment of value for BOD33_EN in the FUSES_USER_WORD_0 register */
#define FUSES_USER_WORD_0_BOD33_EN_DISABLED_Val _UINT32_(0x0) /* (FUSES_USER_WORD_0) BOD33 is disabled  */
#define FUSES_USER_WORD_0_BOD33_EN_ENABLED_Val _UINT32_(0x1) /* (FUSES_USER_WORD_0) BOD33 is enabled  */
#define FUSES_USER_WORD_0_BOD33_EN_DISABLED                                                                            \
        (FUSES_USER_WORD_0_BOD33_EN_DISABLED_Val                                                                       \
         << FUSES_USER_WORD_0_BOD33_EN_Pos) /* (FUSES_USER_WORD_0) BOD33 is disabled Position  */
#define FUSES_USER_WORD_0_BOD33_EN_ENABLED                                                                             \
        (FUSES_USER_WORD_0_BOD33_EN_ENABLED_Val                                                                        \
         << FUSES_USER_WORD_0_BOD33_EN_Pos) /* (FUSES_USER_WORD_0) BOD33 is enabled Position  */
#define FUSES_USER_WORD_0_BOD33_ACTION_Pos _UINT32_(15) /* (FUSES_USER_WORD_0) BOD33 Action Position */
#define FUSES_USER_WORD_0_BOD33_ACTION_Msk                                                                             \
        (_UINT32_(0x3) << FUSES_USER_WORD_0_BOD33_ACTION_Pos) /* (FUSES_USER_WORD_0) BOD33 Action Mask */
#define FUSES_USER_WORD_0_BOD33_ACTION(value)                                                                          \
        (FUSES_USER_WORD_0_BOD33_ACTION_Msk &                                                                          \
         (_UINT32_(value) << FUSES_USER_WORD_0_BOD33_ACTION_Pos)) /* Assigment of value for BOD33_ACTION in the        \
                                                                     FUSES_USER_WORD_0 register */
#define FUSES_USER_WORD_0_BOD33_ACTION_NONE_Val _UINT32_(0x0) /* (FUSES_USER_WORD_0) No action  */
#define FUSES_USER_WORD_0_BOD33_ACTION_RESET_Val _UINT32_(0x1) /* (FUSES_USER_WORD_0) The BOD33 generates a reset  */
#define FUSES_USER_WORD_0_BOD33_ACTION_INTERRUPT_Val                                                                   \
        _UINT32_(0x2) /* (FUSES_USER_WORD_0) The BOD33 generates an interrupt  */
#define FUSES_USER_WORD_0_BOD33_ACTION_NONE                                                                            \
        (FUSES_USER_WORD_0_BOD33_ACTION_NONE_Val                                                                       \
         << FUSES_USER_WORD_0_BOD33_ACTION_Pos) /* (FUSES_USER_WORD_0) No action Position  */
#define FUSES_USER_WORD_0_BOD33_ACTION_RESET                                                                           \
        (FUSES_USER_WORD_0_BOD33_ACTION_RESET_Val                                                                      \
         << FUSES_USER_WORD_0_BOD33_ACTION_Pos) /* (FUSES_USER_WORD_0) The BOD33 generates a reset Position  */
#define FUSES_USER_WORD_0_BOD33_ACTION_INTERRUPT                                                                       \
        (FUSES_USER_WORD_0_BOD33_ACTION_INTERRUPT_Val                                                                  \
         << FUSES_USER_WORD_0_BOD33_ACTION_Pos) /* (FUSES_USER_WORD_0) The BOD33 generates an interrupt Position  */
#define FUSES_USER_WORD_0_WDT_ENABLE_Pos _UINT32_(25) /* (FUSES_USER_WORD_0) WDT Enable Position */
#define FUSES_USER_WORD_0_WDT_ENABLE_Msk                                                                               \
        (_UINT32_(0x1) << FUSES_USER_WORD_0_WDT_ENABLE_Pos) /* (FUSES_USER_WORD_0) WDT Enable Mask */
#define FUSES_USER_WORD_0_WDT_ENABLE(value)                                                                            \
        (FUSES_USER_WORD_0_WDT_ENABLE_Msk &                                                                            \
         (_UINT32_(value) << FUSES_USER_WORD_0_WDT_ENABLE_Pos)) /* Assigment of value for WDT_ENABLE in the            \
                                                                   FUSES_USER_WORD_0 register */
#define FUSES_USER_WORD_0_WDT_ENABLE_DISABLED_Val _UINT32_(0x0) /* (FUSES_USER_WORD_0) WDT is disabled  */
#define FUSES_USER_WORD_0_WDT_ENABLE_ENABLED_Val _UINT32_(0x1) /* (FUSES_USER_WORD_0) WDT is enabled  */
#define FUSES_USER_WORD_0_WDT_ENABLE_DISABLED                                                                          \
        (FUSES_USER_WORD_0_WDT_ENABLE_DISABLED_Val                                                                     \
         << FUSES_USER_WORD_0_WDT_ENABLE_Pos) /* (FUSES_USER_WORD_0) WDT is disabled Position  */
#define FUSES_USER_WORD_0_WDT_ENABLE_ENABLED                                                                           \
        (FUSES_USER_WORD_0_WDT_ENABLE_ENABLED_Val                                                                      \
         << FUSES_USER_WORD_0_WDT_ENABLE_Pos) /* (FUSES_USER_WORD_0) WDT is enabled Position  */
#define FUSES_USER_WORD_0_WDT_ALWAYSON_Pos _UINT32_(26) /* (FUSES_USER_WORD_0) WDT Always On Position */
#define FUSES_USER_WORD_0_WDT_ALWAYSON_Msk                                                                             \
        (_UINT32_(0x1) << FUSES_USER_WORD_0_WDT_ALWAYSON_Pos) /* (FUSES_USER_WORD_0) WDT Always On Mask */
#define FUSES_USER_WORD_0_WDT_ALWAYSON(value)                                                                          \
        (FUSES_USER_WORD_0_WDT_ALWAYSON_Msk &                                                                          \
         (_UINT32_(value) << FUSES_USER_WORD_0_WDT_ALWAYSON_Pos)) /* Assigment of value for WDT_ALWAYSON in the        \
                                                                     FUSES_USER_WORD_0 register */
#define FUSES_USER_WORD_0_WDT_ALWAYSON_DISABLED_Val                                                                    \
        _UINT32_(0x0) /* (FUSES_USER_WORD_0) WDT is enabled and disabled through ENABLE bit  */
#define FUSES_USER_WORD_0_WDT_ALWAYSON_ENABLED_Val                                                                     \
        _UINT32_(0x1) /* (FUSES_USER_WORD_0) WDT is enabled and can only be disabled by a power-on reset  */
#define FUSES_USER_WORD_0_WDT_ALWAYSON_DISABLED                                                                        \
        (FUSES_USER_WORD_0_WDT_ALWAYSON_DISABLED_Val                                                                   \
         << FUSES_USER_WORD_0_WDT_ALWAYSON_Pos) /* (FUSES_USER_WORD_0) WDT is enabled and disabled through ENABLE bit  \
                                                   Position  */
#define FUSES_USER_WORD_0_WDT_ALWAYSON_ENABLED                                                                         \
        (FUSES_USER_WORD_0_WDT_ALWAYSON_ENABLED_Val                                                                    \
         << FUSES_USER_WORD_0_WDT_ALWAYSON_Pos) /* (FUSES_USER_WORD_0) WDT is enabled and can only be disabled by a    \
                                                   power-on reset Position  */
#define FUSES_USER_WORD_0_WDT_PER_Pos _UINT32_(27) /* (FUSES_USER_WORD_0) WDT Period Position */
#define FUSES_USER_WORD_0_WDT_PER_Msk                                                                                  \
        (_UINT32_(0xF) << FUSES_USER_WORD_0_WDT_PER_Pos) /* (FUSES_USER_WORD_0) WDT Period Mask */
#define FUSES_USER_WORD_0_WDT_PER(value)                                                                               \
        (FUSES_USER_WORD_0_WDT_PER_Msk &                                                                               \
         (_UINT32_(value)                                                                                              \
          << FUSES_USER_WORD_0_WDT_PER_Pos)) /* Assigment of value for WDT_PER in the FUSES_USER_WORD_0 register */
#define FUSES_USER_WORD_0_WDT_PER_CYC8_Val _UINT32_(0x0) /* (FUSES_USER_WORD_0) 8 clock cycles  */
#define FUSES_USER_WORD_0_WDT_PER_CYC16_Val _UINT32_(0x1) /* (FUSES_USER_WORD_0) 16 clock cycles  */
#define FUSES_USER_WORD_0_WDT_PER_CYC32_Val _UINT32_(0x2) /* (FUSES_USER_WORD_0) 32 clock cycles  */
#define FUSES_USER_WORD_0_WDT_PER_CYC64_Val _UINT32_(0x3) /* (FUSES_USER_WORD_0) 64 clock cycles  */
#define FUSES_USER_WORD_0_WDT_PER_CYC128_Val _UINT32_(0x4) /* (FUSES_USER_WORD_0) 128 clock cycles  */
#define FUSES_USER_WORD_0_WDT_PER_CYC256_Val _UINT32_(0x5) /* (FUSES_USER_WORD_0) 256 clock cycles  */
#define FUSES_USER_WORD_0_WDT_PER_CYC512_Val _UINT32_(0x6) /* (FUSES_USER_WORD_0) 512 clock cycles  */
#define FUSES_USER_WORD_0_WDT_PER_CYC1024_Val _UINT32_(0x7) /* (FUSES_USER_WORD_0) 1024 clock cycles  */
#define FUSES_USER_WORD_0_WDT_PER_CYC2048_Val _UINT32_(0x8) /* (FUSES_USER_WORD_0) 2048 clock cycles  */
#define FUSES_USER_WORD_0_WDT_PER_CYC4096_Val _UINT32_(0x9) /* (FUSES_USER_WORD_0) 4096 clock cycles  */
#define FUSES_USER_WORD_0_WDT_PER_CYC8192_Val _UINT32_(0xA) /* (FUSES_USER_WORD_0) 8192 clock cycles  */
#define FUSES_USER_WORD_0_WDT_PER_CYC16384_Val _UINT32_(0xB) /* (FUSES_USER_WORD_0) 16384 clock cycles  */
#define FUSES_USER_WORD_0_WDT_PER_CYC8                                                                                 \
        (FUSES_USER_WORD_0_WDT_PER_CYC8_Val                                                                            \
         << FUSES_USER_WORD_0_WDT_PER_Pos) /* (FUSES_USER_WORD_0) 8 clock cycles Position  */
#define FUSES_USER_WORD_0_WDT_PER_CYC16                                                                                \
        (FUSES_USER_WORD_0_WDT_PER_CYC16_Val                                                                           \
         << FUSES_USER_WORD_0_WDT_PER_Pos) /* (FUSES_USER_WORD_0) 16 clock cycles Position  */
#define FUSES_USER_WORD_0_WDT_PER_CYC32                                                                                \
        (FUSES_USER_WORD_0_WDT_PER_CYC32_Val                                                                           \
         << FUSES_USER_WORD_0_WDT_PER_Pos) /* (FUSES_USER_WORD_0) 32 clock cycles Position  */
#define FUSES_USER_WORD_0_WDT_PER_CYC64                                                                                \
        (FUSES_USER_WORD_0_WDT_PER_CYC64_Val                                                                           \
         << FUSES_USER_WORD_0_WDT_PER_Pos) /* (FUSES_USER_WORD_0) 64 clock cycles Position  */
#define FUSES_USER_WORD_0_WDT_PER_CYC128                                                                               \
        (FUSES_USER_WORD_0_WDT_PER_CYC128_Val                                                                          \
         << FUSES_USER_WORD_0_WDT_PER_Pos) /* (FUSES_USER_WORD_0) 128 clock cycles Position  */
#define FUSES_USER_WORD_0_WDT_PER_CYC256                                                                               \
        (FUSES_USER_WORD_0_WDT_PER_CYC256_Val                                                                          \
         << FUSES_USER_WORD_0_WDT_PER_Pos) /* (FUSES_USER_WORD_0) 256 clock cycles Position  */
#define FUSES_USER_WORD_0_WDT_PER_CYC512                                                                               \
        (FUSES_USER_WORD_0_WDT_PER_CYC512_Val                                                                          \
         << FUSES_USER_WORD_0_WDT_PER_Pos) /* (FUSES_USER_WORD_0) 512 clock cycles Position  */
#define FUSES_USER_WORD_0_WDT_PER_CYC1024                                                                              \
        (FUSES_USER_WORD_0_WDT_PER_CYC1024_Val                                                                         \
         << FUSES_USER_WORD_0_WDT_PER_Pos) /* (FUSES_USER_WORD_0) 1024 clock cycles Position  */
#define FUSES_USER_WORD_0_WDT_PER_CYC2048                                                                              \
        (FUSES_USER_WORD_0_WDT_PER_CYC2048_Val                                                                         \
         << FUSES_USER_WORD_0_WDT_PER_Pos) /* (FUSES_USER_WORD_0) 2048 clock cycles Position  */
#define FUSES_USER_WORD_0_WDT_PER_CYC4096                                                                              \
        (FUSES_USER_WORD_0_WDT_PER_CYC4096_Val                                                                         \
         << FUSES_USER_WORD_0_WDT_PER_Pos) /* (FUSES_USER_WORD_0) 4096 clock cycles Position  */
#define FUSES_USER_WORD_0_WDT_PER_CYC8192                                                                              \
        (FUSES_USER_WORD_0_WDT_PER_CYC8192_Val                                                                         \
         << FUSES_USER_WORD_0_WDT_PER_Pos) /* (FUSES_USER_WORD_0) 8192 clock cycles Position  */
#define FUSES_USER_WORD_0_WDT_PER_CYC16384                                                                             \
        (FUSES_USER_WORD_0_WDT_PER_CYC16384_Val                                                                        \
         << FUSES_USER_WORD_0_WDT_PER_Pos) /* (FUSES_USER_WORD_0) 16384 clock cycles Position  */
#define FUSES_USER_WORD_0_WDT_WINDOW_0_Pos _UINT32_(31) /* (FUSES_USER_WORD_0) WDT Window bit 0 Position */
